# 5. DEPLOY

In this notebook we will :

**1) Create Model Object:**
 >For creating a model object we will use Sklearn's Pipeline to ***combine the data preprocessing,data tranformation(Polynomial Transformation & Linear Regression*** step into one package(automate).

**2) Fit & Predict --** Using the derived train data

**3) Save the model --** Using Sklearn's joblib

**4) Deploy solution --** Using the test data for prediction & save it in csv format

In [1]:
cd C:\Users\Jo's\Documents\DSDJ\Portfollio.mod4.5\S1\

C:\Users\Jo's\Documents\DSDJ\Portfollio.mod4.5\S1

In [2]:
!pwd

/c/Users/Jo's/Documents/DSDJ/Portfollio.mod4.5/S1

In [3]:
import sys
sys.path.insert(0, './scripts')

from make_dataset import get_data

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from Preprocessor import Preprocessor #The preprocessor class  

from sklearn.preprocessing import PolynomialFeatures
from sklearn.linear_model import LinearRegression

from sklearn.pipeline import Pipeline

## 5.1 Create Model Object

In [4]:
#autmated pipeline

p=Preprocessor()
my_model = Pipeline([('preprocessor', p),('transformation', PolynomialFeatures(include_bias = False)),\
                     ('model', LinearRegression())])

## NOTE:
>The pipeline object called my_model implements fit and predict methods. When we call the fit method, the pipeline will execute *preprocessor.fit_transform()* on the data we pass in the arguments, then pass that result to *PolynomialFeatures.fi_transform()* and finally pass the results to The LinearRegression.fit().Similarly, when we call the predict method, it will execute *preprocessor.transform()* and *PolynomialFeatures.transform()* and then *LinearRegression.predict()*.

## 5.2 Fit & Predict

In [5]:
# get train and test data

features,target=get_data("Train")
test_data,ids_df=get_data("Test")

In [6]:
print(features.shape)
features.head()

(1000000, 6)

,jobType,degree,major,industry,yearsExperience,milesFromMetropolis
0,CFO,MASTERS,MATH,HEALTH,10,83
1,CEO,HIGH_SCHOOL,NONE,WEB,3,73
2,VICE_PRESIDENT,DOCTORAL,PHYSICS,HEALTH,10,38
3,MANAGER,DOCTORAL,CHEMISTRY,AUTO,8,17
4,VICE_PRESIDENT,BACHELORS,PHYSICS,FINANCE,8,16

In [7]:
print(target.shape)
target.head()

(1000000, 1)

   salary
0     130
1     101
2     137
3     142
4     163

In [8]:
test_data.head()

,jobType,degree,major,industry,yearsExperience,milesFromMetropolis
0,MANAGER,HIGH_SCHOOL,NONE,HEALTH,22,73
1,JUNIOR,NONE,NONE,AUTO,20,47
2,CTO,MASTERS,BIOLOGY,HEALTH,17,9
3,MANAGER,HIGH_SCHOOL,NONE,OIL,14,96
4,JUNIOR,DOCTORAL,BIOLOGY,OIL,10,44

In [9]:
#fit the model
my_model.fit(features,target)

Pipeline(memory=None,
     steps=[('preprocessor', <Preprocessor.Preprocessor object at 0x000001D4D721D5F8>), ('transformation', PolynomialFeatures(degree=2, include_bias=False, interaction_only=False)), ('model', LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False))])

# rough

In [70]:
from sklearn.model_selection import train_test_split

In [71]:
def split(X,Y):
    return(train_test_split(X,Y, test_size = 0.2, random_state = 40))

In [72]:
xtrain, xtest, ytrain, ytest=split(features,target)

In [20]:
a=pd.DataFrame([["CFO","MASTERS","MATH","HEALTH",10,83]],columns=test_data.columns)

In [21]:
a

  jobType   degree major industry  yearsExperience  milesFromMetropolis
0     CFO  MASTERS  MATH   HEALTH               10                   83

In [10]:
test_copy=test_data.copy()

In [37]:
test_copy=test_copy.append(a, ignore_index=True)

In [75]:
#with 50 rows
test_copy1=test_copy[:100000]
test_copy1=test_copy1.append(a, ignore_index=True)

In [27]:
#whole test predict
pr1=my_model.predict(test_copy)

In [76]:
pr2=my_model.predict(test_copy1)

In [77]:
pr2=pd.DataFrame(pr2)

In [79]:
test_copy1.tail()

,jobType,degree,major,industry,yearsExperience,milesFromMetropolis
99996,VICE_PRESIDENT,BACHELORS,COMPSCI,SERVICE,9,25
99997,CFO,BACHELORS,CHEMISTRY,HEALTH,17,14
99998,CEO,DOCTORAL,BUSINESS,FINANCE,17,89
99999,SENIOR,BACHELORS,PHYSICS,WEB,0,23
100000,CFO,MASTERS,MATH,HEALTH,10,83

In [78]:
pr2.tail()

                 0
99996    61.406972
99997   189.079739
99998   155.864133
99999    88.743497
100000  120.077115

In [80]:
train1111=pd.read_csv("data/derived_data/train_data.csv")

In [81]:
train1111.head()

,companyId,jobType,degree,major,industry,yearsExperience,milesFromMetropolis,salary
0,COMP37,CFO,MASTERS,MATH,HEALTH,10,83,130
1,COMP19,CEO,HIGH_SCHOOL,NONE,WEB,3,73,101
2,COMP52,VICE_PRESIDENT,DOCTORAL,PHYSICS,HEALTH,10,38,137
3,COMP38,MANAGER,DOCTORAL,CHEMISTRY,AUTO,8,17,142
4,COMP7,VICE_PRESIDENT,BACHELORS,PHYSICS,FINANCE,8,16,163

In [86]:
train1111[train1111.salary>300]

,companyId,jobType,degree,major,industry,yearsExperience,milesFromMetropolis,salary
400611,COMP45,CFO,DOCTORAL,ENGINEERING,OIL,23,3,301
685562,COMP47,CTO,MASTERS,ENGINEERING,OIL,24,0,301

# END

In [11]:
#make predictions on the test data 
salary_pred = my_model.predict(test_data)

In [12]:
salary_pred

array([[120.70641029],
       [ 84.76846015],
       [139.26492011],
       ...,
       [ 30.92256248],
       [134.89255225],
       [105.10714423]])

In [ ]:
# Saving predicted salaries to an external csv

salary_pred = pd.DataFrame(salary_pred, index=test_data.index)
final_output=pd.merge(ids_df,test_data,left_index=True, right_index=True)
final_output["salary"]=features["jobType"]

!mkdir "/final_output"
final_output.to_csv('final_output/test_salaries.csv', header=True)

## 5.3 Save model

In [ ]:
!mkdir -p models

In [ ]:
from sklearn.externals import joblib
joblib.dump(my_model, 'models/model.pkl')